RTP/src/Tasks/ЗадачаБП/ЗадачаБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаБП</name>
  <addressing>InformationRegister.РегистрАдресации</addressing>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадачи</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>ТипПользователя</name>
    <type>
      <types>EnumRef.ТипыПользователей</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

RTP/src/Enums/СтатусыЗадачи/СтатусыЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадачи</name>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Закрытый</name>
  </enumValues>
</mdclass:Enum>

RTP/src/Tasks/ЗадачаБП/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокОткрытоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусЗадач(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Открытый"));
КонецПроцедуры

&НаКлиенте
Процедура СписокНаИсполненииПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусЗадач(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.НаИсполнении"));
КонецПроцедуры

&НаКлиенте
Процедура СписокЗакрытоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ОбновитьСтатусЗадач(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадачи.Закрытый"));
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеЗадачи(Команда)
	ПолучитьФорму("Задача.ЗадачаБП.Форма.ФормаСпискаВсеЗадачи").Открыть();
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусЗадач(ВыбранныеЭлементы, НовыйСтатусЗадачи)
	Для Каждого Элемент Из ВыбранныеЭлементы Цикл
		Задача = Элемент.ПолучитьОбъект();
		Если Задача.Статус = НовыйСтатусЗадачи Тогда
			Продолжить
		Иначе
			Задача.Статус = НовыйСтатусЗадачи;
			
			Если НовыйСтатусЗадачи = Перечисления.СтатусыЗадачи.Закрытый Тогда
				Задача.Выполнена = Истина;
			Иначе
				Задача.Выполнена = Ложь;
			КонецЕсли;
			
			Попытка
				Задача.Записать();				
			Исключение
				СообщениеОбОшибке = Новый СообщениеПользователю();
				СообщениеОбОшибке.Текст = ОписаниеОшибки();
				СообщениеОбОшибке.Сообщить();
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЗадач(ВыбранныеЗаписи, НовыйСтатус)
	УстановитьСтатусЗадач(ВыбранныеЗаписи, НовыйСтатус);
	ОбновитьИнтерфейс();
КонецПроцедуры
